app/views/monthly_self_examinations/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 6]]
---
        <tr>
            <% student = @users.find(monthly_self_examination.user_id)%>