app/controllers/monthly_self_examinations_controller.rb

SELECT "monthly_self_examinations".* FROM "monthly_self_examinations" WHERE "monthly_self_examinations"."user_id" = ?  [["user_id", 6]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
SELECT "monthly_self_examinations".* FROM "monthly_self_examinations"
---
    def index
      @users = User.all
      if current_user.has_role? :student
        @monthly_self_examinations = MonthlySelfExamination.where(user_id: current_user.id)
      elsif current_user.has_role? :teacher
        @monthly_self_examinations = MonthlySelfExamination.where(user_id: User.where(teacher_id: current_user.id))
      elsif current_user.has_role? :tutor
        @monthly_self_examinations = MonthlySelfExamination.where(user_id: User.where(tutor_id: current_user.id))
      else
        @monthly_self_examinations = MonthlySelfExamination.all

INSERT INTO "monthly_self_examinations" ("periode", "what_ive_done", "what_ive_learnt", "what_ive_felt", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        if user_signed_in?
            @monthly_self_examination = MonthlySelfExamination.new(monthly_self_examination_params)
            @monthly_self_examination.user = current_user
        end

        respond_to do |format|
            if @monthly_self_examination.save

DELETE FROM "monthly_self_examinations" WHERE "monthly_self_examinations"."id" = ?  [["id", 1]]
---
    def destroy
        @monthly_self_examination.destroy

SELECT  "monthly_self_examinations".* FROM "monthly_self_examinations" WHERE "monthly_self_examinations"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_monthly_self_examination
        @monthly_self_examination = MonthlySelfExamination.find(params[:id])